wikis/VOS/plain-html/VirtTipsAndTricksSOAPRequestsAgainstSPARQLEndpoint.html

<html><body><div class="topic-text"><!--Begin of %META:TOPICPARENT{name="VirtTipsAndTricksGuide"}%--><p> </p>
<!--End of %META:TOPICPARENT{name="VirtTipsAndTricksGuide"}%--><p> </p>
<h1><a name="How Can I send SOAP requests to a Virtuoso SPARQL Endpoint?"></a>How Can I send SOAP requests to a Virtuoso SPARQL Endpoint?</h1>
<p> The following example presents a sample scenario on how to execute a SPARQL query as a SOAP request to the Virtuoso SPARQL Endpoint.</p>
<ol><li>Assume the following sample SOAP request containing simple SPARQL query: <br><pre><br>&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
   &lt;soapenv:Body&gt;
      &lt;query-request xmlns=&quot;http://www.w3.org/2005/09/sparql-protocol-types/#&quot;&gt;
         &lt;query xmlns=&quot;&quot;&gt;SELECT DISTINCT ?z FROM virtrdf: {?x ?y ?z .} LIMIT 10&lt;/query&gt;
      &lt;/query-request&gt;
   &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</pre><br></li>
<li>Save locally the content from above for ex.
 to file with the name &quot;soap.xml&quot;.
</li>
<li>To pass the SOAP request to a Virtuoso SPARQL Endpoint, execute the following curl command: <br><pre><br>$ curl -d@soap.xml -H &quot;Content-Type:text/xml&quot; -H &quot;SOAPAction: &#39;&#39;&quot; http://localhost:8890/sparql
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soapenv:Body&gt;
    &lt;query-result xmlns=&quot;http://www.w3.org/2005/09/sparql-protocol-types/#&quot;&gt;
      &lt;sparql xmlns=&quot;http://www.w3.org/2005/sparql-results#&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:schemaLocation=&quot;http://www.w3.org/2001/sw/DataAccess/rf1/result2.xsd&quot;&gt;
        &lt;head&gt;
         &lt;variable name=&quot;z&quot;/&gt;
        &lt;/head&gt;
        &lt;results distinct=&quot;false&quot; ordered=&quot;true&quot;&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadStorage&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapFormat&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMap&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapValue&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapColumn&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapColumn&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapATable&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapATable&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;
          &lt;result&gt;
            &lt;binding name=&quot;z&quot;&gt;
             &lt;uri&gt;http://www.openlinksw.com/schemas/virtrdf#QuadMapFText&lt;/uri&gt;
            &lt;/binding&gt;
          &lt;/result&gt;          
        &lt;/results&gt;        
      &lt;/sparql&gt;
    &lt;/query-result&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</pre><br> </li>
</ol><h2><a name="Related"></a>Related</h2>
<ul><li><a href="http://vos.openlinksw.com:80/dataspace/owiki/wiki/VOS/VirtTipsAndTricksGuide" class="wikiword">Virtuoso Tips and Tricks Collection</a> </li>
<li><a href="http://docs.openlinksw.com/virtuoso/soap.html#soapovervw" class="absuri">Virtuoso SOAP</a> </li>
</ul></div></body></html>